from django.conf import settings

DATABASES = {
    'default': {
        'ENGINE': 'django.db.backends.sqlite3',
        'NAME': settings.BASE_DIR / 'db.sqlite3',
    }
}

# -------------------------------------------------------------------- #
# يُستخدم هذا الإعداد كآلية أمان لضمان أن أي مجموعة من عمليات قاعدة    #
# البيانات المرتبطة بطلب                                               #
# واحد إما تُنفذ بالكامل وتنجح                                         #
# أو إذا حدث أي فشل في أي جزء منها، يتم التراجع عن كل شيء              #
# لمنع تلوث حالة قاعدة البيانات   
ATOMIC_REQUESTS = True                                       #
# -------------------------------------------------------------------- #
                                                      

